package com.myaushka.whatwishbot.constants.bot;

/**
 * Текстовые сообщения, посылаемые ботом
 */
public enum BotMessageEnum {
    //ответы на команды с клавиатуры
    HELP_MESSAGE("Привет, если хочешь узнать, чего от тебя хочет Бог, то жми: /whatwish \n выполнив цель своей жизни, у тебя жизнь наладится"),
    WHAT_MESSAGE("""
            Приветствую тебя, смертный! Ты пришел ко мне, значит ты хочешь узнать, чего же хочет Бог! Всё просто, для того, чтобы жизнь наладилась, тебе нужно всего насвего выполнить свою миссию, почле чего ты сможешь провести оставшуся жизнь без забот.\s

            Итак, твоя миссия заключается в следующем:\s"""),
    START_MESSAGE("""
            Приветствую тебя, смертный!\s
            Ты пришел ко мне, значит ты хочешь узнать, чего же хочет Бог! Всё просто, для того, чтобы жизнь наладилась, тебе нужно всего лишь выполнить свою миссию, после чего ты сможешь провести оставшуюся жизнь без забот.\s

            Итак, чтобы узнать, в чём же заключается смысл твоей жизни, жми: /whatwish"""),
    NON_COMMAND_MESSAGE("Пожалуйста, воспользуйтесь клавиатурой\uD83D\uDC47"),
    OO_MESSAGE("Не, это дичь какая-то, попробуй ещё раз"),

    //результаты загрузки словаря

    //ошибки при обработке callback-ов
    EXCEPTION_BAD_BUTTON_NAME_MESSAGE("Неверное значение кнопки. Крайне странно. Попробуйте позже"),
    EXCEPTION_DICTIONARY_NOT_FOUND_MESSAGE("Словарь не найден"),
    EXCEPTION_DICTIONARY_WTF_MESSAGE("Нежиданная ошибка при попытке получить словарь. Сам в шоке"),
    EXCEPTION_TASKS_WTF_MESSAGE("Нежиданная ошибка при попытке получить задания. Сам в шоке"),
    EXCEPTION_TEMPLATE_WTF_MESSAGE("Нежиданная ошибка при попытке получить шаблон. Сам в шоке"),

    //прочие ошибки
    EXCEPTION_ILLEGAL_MESSAGE("Нет, к такому меня не готовили! Я работаю или с текстом, или с файлом"),
    EXCEPTION_WHAT_THE_FUCK("Что-то пошло не так.");

    private final String message;

    BotMessageEnum(String message) {
        this.message = message;
    }

    public String getMessage() {
        return message;
    }
}